Pandas Course

In [2]:
import pandas as pd

In [3]:
pd.__version__
# This script checks the version of the pandas library installed in the environment.

'2.3.1'

Pandas Series and Series Operations

Series is a one-dimensional array, like object that can hold various data types, including integer, float and strings.

In [4]:
my_series_mixed = pd.Series([10,20,30,6.0,7.0,8.0,"Jan","Feb","Mar"], index=["a","b","c","d","e","f","g","h","i"])
my_series_mixed

a     10
b     20
c     30
d    6.0
e    7.0
f    8.0
g    Jan
h    Feb
i    Mar
dtype: object

In [5]:
type(my_series_mixed)

pandas.core.series.Series

In [6]:
my_series_int = pd.Series([10,20,30], index=["a","b","c"])
my_series_int

a    10
b    20
c    30
dtype: int64

In [7]:
type(my_series_int)

pandas.core.series.Series

In [8]:
my_series_float = pd.Series([6.0,7.0,8.0], index=["a","b","c"])
my_series_float

a    6.0
b    7.0
c    8.0
dtype: float64

In [9]:
type(my_series_float)

pandas.core.series.Series

In [10]:
my_series_month = pd.Series(["Jan","Feb","Mar"], index=["a","b","c"])
my_series_month

a    Jan
b    Feb
c    Mar
dtype: object

In [11]:
type(my_series_month)

pandas.core.series.Series

In [12]:
my_series_month

a    Jan
b    Feb
c    Mar
dtype: object

In [13]:
my_series_month["a"]  # Accessing the first element of the series

'Jan'

In [14]:
my_series_mixed["b":"d"] # Accessing a slice of the series from index 'b' to 'd'

b     20
c     30
d    6.0
dtype: object

In [15]:
my_series_int

a    10
b    20
c    30
dtype: int64

In [16]:
my_series_int + 5
# Adding 5 to each element in the integer series

a    15
b    25
c    35
dtype: int64

In [17]:
my_series_float

a    6.0
b    7.0
c    8.0
dtype: float64

In [18]:
my_series_float * 2
# Multiplying each element in the float series by 2

a    12.0
b    14.0
c    16.0
dtype: float64

In [19]:
my_series_float

a    6.0
b    7.0
c    8.0
dtype: float64

In [20]:
my_series_float / 2
# Dividing each element in the float series by 2

a    3.0
b    3.5
c    4.0
dtype: float64

In [21]:
my_series_float

a    6.0
b    7.0
c    8.0
dtype: float64

Series - Data Types

In [22]:
type(my_series_float)

# This returns the Python type of the object my_series_float.
#  It tells you that my_series_float is a Pandas Series object.
# <class 'pandas.core.series.Series'>

pandas.core.series.Series

In [23]:
my_series_float.dtype
# This returns type of the data inside the Series
# It tells you that the data stored in the Series is of type float64.

dtype('float64')

In [24]:
type(my_series_float["a"])

# This returns the type of a single element from the Series, not the Series itself.

numpy.float64

Series Methods

In [25]:
my_series_float.size 
# This returns the number of elements in the Series.

3

In [26]:
my_series_float.shape
# This returns the shape of the Series, which is a tuple representing its dimensions.
# For a 1D Series, it will return (n,), where n is the number of elements in the Series.

(3,)

In [27]:
my_series_mixed

a     10
b     20
c     30
d    6.0
e    7.0
f    8.0
g    Jan
h    Feb
i    Mar
dtype: object

In [28]:
my_series_mixed.head()
# This returns the first 5 elements of the Series. 
# If the Series has fewer than 5 elements, it returns all of them.

a     10
b     20
c     30
d    6.0
e    7.0
dtype: object

In [29]:
my_series_mixed.tail()
# This returns the last 5 elements of the Series. 
# If the Series has fewer than 5 elements, it returns all of them.

e    7.0
f    8.0
g    Jan
h    Feb
i    Mar
dtype: object

In [30]:
my_series_mixed.head(3)
# This returns the first 3 elements of the Series.

a    10
b    20
c    30
dtype: object

In [31]:
my_series_mixed.tail(3)
# This returns the last 3 elements of the Series.

g    Jan
h    Feb
i    Mar
dtype: object

Descriptive Statistics for Numeric Values

In [32]:
my_series_int

a    10
b    20
c    30
dtype: int64

In [ ]:
my_series_int.describe()
# This provides a summary of statistics for the integer Series,
#  including count, mean, standard deviation, min, max, and quartiles.
#  Also displays the output data type of the series, float64.

count     3.0
mean     20.0
std      10.0
min      10.0
25%      15.0
50%      20.0
75%      25.0
max      30.0
dtype: float64

In [34]:
my_series_stats = pd.Series([81,93,98,89,88], index=["a","b","c","d","e"])
my_series_stats

a    81
b    93
c    98
d    89
e    88
dtype: int64

In [36]:
my_series_stats.describe()
# This provides a summary of statistics for the Series containing statistics,
#  including count, mean, standard deviation, min, max, and quartiles.
#  Also displays the output data type of the series, float64

count     5.000000
mean     89.800000
std       6.300794
min      81.000000
25%      88.000000
50%      89.000000
75%      93.000000
max      98.000000
dtype: float64

In [38]:
my_series_stats1 = pd.Series([10, 20, 30, 40, 50, 60, 70], index=["a","b","c","d","e","f","g"])
my_series_stats1

a    10
b    20
c    30
d    40
e    50
f    60
g    70
dtype: int64

In [40]:
my_series_stats1.describe()
# This provides a summary of statistics for the Series containing statistics,
#  including count, mean, standard deviation, min, max, and quartiles.
#  Also displays the output data type of the series, float64.

count     7.000000
mean     40.000000
std      21.602469
min      10.000000
25%      25.000000
50%      40.000000
75%      55.000000
max      70.000000
dtype: float64

In [42]:
my_series_stats.sort_values(ascending=True)
# This sorts the Series containing statistics in ascending order.
# The output will show the index and values sorted from lowest to highest.

a    81
e    88
d    89
b    93
c    98
dtype: int64

In [43]:
my_series_stats.sort_values(ascending=False)
# This sorts the Series containing statistics in descending order.
# The `ascending=False` parameter specifies that the sort should be in descending order.

c    98
b    93
d    89
e    88
a    81
dtype: int64

Data Frames - Key data structure in pandas library, for handling and analyzing complex data sets

In [44]:
data = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 30, 35],
        "City": ["New York", "Los Angeles", "Chicago"]}

In [45]:
data

{'Name': ['Alice', 'Bob', 'Charlie'],
 'Age': [25, 30, 35],
 'City': ['New York', 'Los Angeles', 'Chicago']}

In [85]:
df_dict = pd.DataFrame(data)
# This creates a DataFrame from the dictionary `data`.

df_dict
# This displays the DataFrame created from the dictionary `data`.

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [57]:
data1 = {"Name": "Srinivas", "Age": 40, "City": "Hyderabad"}
# This is a dictionary with one row of data and not a column wise list for multiple rows.

In [59]:
data1
# This displays the dictionary `data1`.

{'Name': 'Srinivas', 'Age': 40, 'City': 'Hyderabad'}

In [86]:
df_dict1 = pd.DataFrame([data1])
# To create data frame for this single row dictionary, we wrap it in a list.

df_dict1
# This displays the DataFrame created from the single row dictionary `data1`.

       Name  Age       City
0  Srinivas   40  Hyderabad

In [70]:
data_list = [["Srinivas", 40, "Hyderabad"],["John", 30, "New York"], ["Alice", 25, "Los Angeles"]]

# This is a list with three array lists, not a dictionary.

In [71]:
data_list

[['Srinivas', 40, 'Hyderabad'],
 ['John', 30, 'New York'],
 ['Alice', 25, 'Los Angeles']]

In [74]:
df_list = pd.DataFrame(data_list, columns = ["Name", "Age", "City"])

In [75]:
df_list

       Name  Age         City
0  Srinivas   40    Hyderabad
1      John   30     New York
2     Alice   25  Los Angeles

Data Frames using Numpy Arrays

In [76]:
import numpy as np

In [78]:
data_array = np.array([[1,2,3],[4,5,6],[7,8,9]])

In [79]:
data_array

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [80]:
df_numpy_array = pd.DataFrame(data_array, columns=["Column1", "Column2", "Column3"])

In [81]:
df_numpy_array

   Column1  Column2  Column3
0        1        2        3
1        4        5        6
2        7        8        9

In [82]:
type(df_numpy_array)

pandas.core.frame.DataFrame

In [84]:
type(df_list)

pandas.core.frame.DataFrame

In [87]:
type(df_dict)

pandas.core.frame.DataFrame

In [88]:
type(df_dict1)

pandas.core.frame.DataFrame

Creating data frames from various file formats using CSV and Excel

In [92]:
data = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 30, 35],
        "City": ["New York", "Los Angeles", "Chicago"]}

data

df_new_dict = pd.DataFrame(data)
df_new_dict

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

Writing the daframe to CSV File

In [94]:
# Writing the dataframe to CSV File
df.to_csv("newdatadict.csv", index=False)

In [96]:
# Writing dataframe back from CSV file
df_read_newdatadict_csv = pd.read_csv("newdatadict.csv")

df_read_newdatadict_csv

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3     Ravi   40    Hyderabad
4   Anjali   28       Mumbai
5   Suresh   32    Bangalore

Loading data from Excel File - Data Frame

In [101]:
df_dict

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [106]:
# Loading data to Excel file - Data Frame
df_dict.to_excel("newdatadict.xlsx", index=False)

In [109]:
# Reading data from Excel file - Data Frame
df_dict_excel_read = pd.read_excel("newdatadict.xlsx")

df_dict_excel_read

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3      Ram   26    Hyderabad
4    Seenu   30    Bangalore
5     Sita   26     Kolkatta

Dataframe Operations

In [110]:
data = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 30, 35],
        "City": ["New York", "Los Angeles", "Chicago"]}

data

df_new_dict = pd.DataFrame(data)
df_new_dict

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [126]:
df_new_dict.head()
# Fetching the first 5 rows of the DataFrame.

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [127]:
df_new_dict.head(2)

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

In [133]:
df_new_dict.tail()
# Fetching the last 5 rows of the DataFrame.

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [129]:
df.tail(2)

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [134]:
# Selecting Specific Columns
df_new_dict[['Name','City']]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [135]:
type(df_new_dict[['Name','City']])
# Dataframe requires two square brackets to select multiple columns.

pandas.core.frame.DataFrame

In [136]:
df_new_dict[['Name']]
# Selecting a single column with two square brackets returns a DataFrame, while one bracket returns a Series.

      Name
0    Alice
1      Bob
2  Charlie

In [123]:
df[['Name']].values
# This returns the values of the DataFrame as a NumPy array.

array([['Alice'],
       ['Bob'],
       ['Charlie']], dtype=object)

In [138]:
# Filtering DataFrame Rows

df_new_dict[df_new_dict["Age"]>25]

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [139]:
df_new_dict[df_new_dict["Name"] == "Alice"]

    Name  Age      City
0  Alice   25  New York

In [142]:
# Filtering DataFrame Rows with Multiple Conditions
df_new_dict[(df_new_dict["City"] == "New York") & (df_new_dict["Age"] > 30)]

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [144]:
# Filtering DataFrame Rows with Multiple Conditions
df_new_dict[(df_new_dict["City"] == "New York") | (df_new_dict["Age"] > 30)]

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [145]:
# Filtering DataFrame Rows with Multiple Conditions
df_new_dict[(df_new_dict["City"] == "New York") & (df_new_dict["Age"] < 30)]

    Name  Age      City
0  Alice   25  New York

In [146]:
df_new_dict

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [153]:
selected_cities = ["New York", "Chicago"]
selected_cities

['New York', 'Chicago']

In [156]:
df_new_dict[df_new_dict["City"].isin (selected_cities)]
# Filtering rows where city is in the selected list of cities.

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [155]:
df_new_dict[df_new_dict["Name"].str.startswith("A")]
# Filtering rows where the "Name" starts with "A"

    Name  Age      City
0  Alice   25  New York

In [158]:
df_new_dict[df_new_dict["Name"].str.endswith("e")]
# Filtering rows where the "Name" ends with "e"

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [159]:
df_new_dict

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [161]:
df_new_dict.iloc[0:2]
# Selecting the first two rows of the DataFrame using iloc.

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles